{
  "intents": [
    {
      "tag": "saludo",
      "patterns": [
        "Hola",
        "¿Cómo estás?",
        "Buenos días",
        "Buenas tardes",
        "Buenas noches",
        "Hola, ¿qué tal?",
        "¿Qué onda?",
        "¿Cómo te va?"
      ],
      "responses": [
        "¡Hola! Soy tu asistente de seguridad. ¿En qué puedo ayudarte hoy?",
        "¡Hola! Estoy aquí para ayudarte con todo lo relacionado con seguridad. ¿Qué necesitas?",
        "¡Hola! ¿En qué puedo asistirte hoy?"
      ]
    },
    {
      "tag": "despedida",
      "patterns": [
        "Adiós",
        "Hasta luego",
        "Nos vemos",
        "Chao",
        "Hasta pronto",
        "Bye",
        "Nos vemos luego"
      ],
      "responses": [
        "¡Adiós! Recuerda mantener tus contraseñas seguras.",
        "¡Hasta luego! No dudes en volver si necesitas más ayuda.",
        "¡Chao! Cuida tu seguridad en línea."
      ]
    },
    {
      "tag": "generar_contraseña",
      "patterns": [
        "Genera una contraseña segura",
        "Necesito una contraseña fuerte",
        "¿Puedes crear una contraseña para mí?",
        "Contraseña segura",
        "Crea una contraseña",
        "Generar contraseña",
        "Dame una contraseña segura"
      ],
      "responses": [
        "Aquí tienes una contraseña segura: ||contraseña||",
        "Claro, aquí tienes una contraseña fuerte: ||contraseña||",
        "Esta es una contraseña segura para ti: ||contraseña||"
      ]
    },
    {
      "tag": "analizar_contraseña",
      "patterns": [
        "Analiza esta contraseña",
        "¿Es segura esta contraseña?",
        "Revisa mi contraseña",
        "¿Qué opinas de esta contraseña?",
        "Evalúa esta contraseña",
        "¿Es fuerte esta contraseña?",
        "Checa esta contraseña"
      ],
      "responses": [
        "Por favor, ingresa la contraseña que deseas analizar.",
        "Claro, ingresa la contraseña y la revisaré por ti.",
        "Dame la contraseña y la analizaré para ti."
      ]
    },
    {
      "tag": "guardar_contraseña",
      "patterns": [
        "Guarda esta contraseña",
        "¿Cómo guardo una contraseña?",
        "Quiero guardar una contraseña",
        "Guardar contraseña en la bóveda",
        "Almacenar contraseña",
        "Guardar clave",
        "¿Dónde guardo mi contraseña?"
      ],
      "responses": [
        "Para guardar una contraseña, ve a la pestaña 'Bóveda' y sigue las instrucciones.",
        "Puedes guardar tus contraseñas en la bóveda de contraseñas. Ve a la pestaña 'Bóveda' para más detalles.",
        "Guarda tus contraseñas en la bóveda. Ve a la pestaña 'Bóveda' y añade una nueva contraseña."
      ]
    },
    {
      "tag": "ver_contraseñas",
      "patterns": [
        "Muestra mis contraseñas",
        "¿Dónde están mis contraseñas?",
        "Ver contraseñas guardadas",
        "Acceder a la bóveda",
        "Ver mis claves",
        "¿Cómo veo mis contraseñas?",
        "Mostrar contraseñas"
      ],
      "responses": [
        "Puedes ver tus contraseñas guardadas en la pestaña 'Bóveda'.",
        "Tus contraseñas están seguras en la bóveda. Ve a la pestaña 'Bóveda' para acceder a ellas.",
        "Accede a la bóveda en la pestaña 'Bóveda' para ver tus contraseñas guardadas."
      ]
    },
    {
      "tag": "eliminar_contraseña",
      "patterns": [
        "Elimina una contraseña",
        "¿Cómo borro una contraseña?",
        "Quiero eliminar una contraseña",
        "Borrar contraseña de la bóveda",
        "Eliminar clave",
        "Quitar contraseña",
        "¿Cómo elimino una contraseña guardada?"
      ],
      "responses": [
        "Para eliminar una contraseña, ve a la pestaña 'Bóveda' y selecciona la contraseña que deseas eliminar.",
        "Puedes eliminar contraseñas desde la bóveda. Ve a la pestaña 'Bóveda' para más detalles.",
        "Elimina contraseñas desde la bóveda. Ve a la pestaña 'Bóveda' y selecciona la contraseña que deseas borrar."
      ]
    },
    {
      "tag": "generar_llave",
      "patterns": [
        "Genera una llave de acceso",
        "Necesito una llave segura",
        "¿Puedes crear una llave para mí?",
        "Llave de acceso segura",
        "Crear llave de acceso",
        "Generar llave",
        "Dame una llave segura"
      ],
      "responses": [
        "Aquí tienes una llave de acceso segura: ||llave||",
        "Claro, aquí tienes una llave de acceso fuerte: ||llave||",
        "Esta es una llave de acceso segura para ti: ||llave||"
      ]
    },
    {
      "tag": "escanear_vulnerabilidades",
      "patterns": [
        "Escanear un sitio web",
        "¿Cómo escaneo un sitio?",
        "Revisar vulnerabilidades",
        "Escáner de seguridad",
        "Analizar sitio web",
        "Checar vulnerabilidades",
        "¿Cómo reviso un sitio web?"
      ],
      "responses": [
        "Para escanear un sitio web, ve a la pestaña 'Escáner Web' e ingresa la URL.",
        "Puedes escanear sitios web en busca de vulnerabilidades en la pestaña 'Escáner Web'.",
        "Escanea sitios web en la pestaña 'Escáner Web'. Ingresa la URL y comienza el análisis."
      ]
    },
    {
      "tag": "verificar_fuga",
      "patterns": [
        "Verificar si mi contraseña ha sido comprometida",
        "¿Ha sido filtrada mi contraseña?",
        "Revisar fuga de datos",
        "Verificar fuga de contraseña",
        "Checar si mi contraseña fue filtrada",
        "¿Mi contraseña está en una fuga?",
        "Revisar si mi clave fue comprometida"
      ],
      "responses": [
        "Para verificar si tu contraseña ha sido comprometida, ve a la pestaña 'Verificador de Fugas' e ingresa tu contraseña.",
        "Puedes verificar si tu contraseña ha sido expuesta en fugas de datos en la pestaña 'Verificador de Fugas'.",
        "Revisa si tu contraseña ha sido comprometida en la pestaña 'Verificador de Fugas'."
      ]
    },
    {
      "tag": "ayuda",
      "patterns": [
        "¿Cómo funciona esto?",
        "Necesito ayuda",
        "¿Qué puedo hacer aquí?",
        "Ayuda",
        "¿Cómo uso esta aplicación?",
        "¿Qué opciones tengo?",
        "¿Cómo me ayudas?"
      ],
      "responses": [
        "Puedo ayudarte a generar contraseñas seguras, analizar contraseñas, guardar contraseñas, escanear sitios web y más. ¿Qué necesitas?",
        "Estoy aquí para ayudarte con la seguridad de tus contraseñas y sitios web. ¿En qué puedo ayudarte?",
        "Puedo ayudarte con la generación de contraseñas, análisis de seguridad, y más. ¿Qué necesitas?"
      ]
    },
    {
      "tag": "agradecimiento",
      "patterns": [
        "Gracias",
        "Muchas gracias",
        "Te lo agradezco",
        "Gracias por la ayuda",
        "Mil gracias",
        "Agradecido",
        "Gracias, eres genial"
      ],
      "responses": [
        "¡De nada! Siempre estoy aquí para ayudarte.",
        "¡No hay problema! Si necesitas más ayuda, no dudes en preguntar.",
        "¡Gracias a ti! Recuerda que estoy aquí para lo que necesites."
      ]
    },
    {
      "tag": "seguridad_contraseñas",
      "patterns": [
        "¿Cómo hago una contraseña segura?",
        "Consejos para contraseñas seguras",
        "¿Qué hace que una contraseña sea segura?",
        "Recomendaciones para contraseñas",
        "¿Cómo crear una contraseña fuerte?",
        "Tips para contraseñas seguras",
        "¿Qué debe tener una contraseña segura?"
      ],
      "responses": [
        "Una contraseña segura debe tener al menos 12 caracteres, incluir mayúsculas, minúsculas, números y símbolos. Evita usar nombres comunes o secuencias simples.",
        "Para una contraseña segura, usa una combinación de letras, números y símbolos. Además, asegúrate de que sea larga y no uses información personal.",
        "Una contraseña fuerte debe ser larga, única y contener una mezcla de caracteres. Evita usar palabras comunes o secuencias predecibles."
      ]
    },
    {
      "tag": "error",
      "patterns": [],
      "responses": [
        "Lo siento, no entendí. ¿Podrías reformularlo?",
        "No estoy seguro de lo que quieres decir. ¿Puedes intentarlo de nuevo?",
        "No capté eso. ¿Podrías decirlo de otra manera?"
      ]
    },
    {
      "tag": "cambiar_contraseña",
      "patterns": [
        "¿Cómo cambio mi contraseña?",
        "Quiero cambiar mi contraseña",
        "Cambiar clave",
        "Actualizar contraseña",
        "Modificar contraseña",
        "¿Cómo actualizo mi contraseña?",
        "Necesito cambiar mi clave"
      ],
      "responses": [
        "Para cambiar tu contraseña, ve a la configuración de seguridad de la plataforma donde deseas hacer el cambio.",
        "Cambia tu contraseña desde la configuración de seguridad de tu cuenta. Asegúrate de usar una contraseña fuerte.",
        "Actualiza tu contraseña en la sección de seguridad de tu cuenta. Recuerda seguir las recomendaciones para contraseñas seguras."
      ]
    },
    {
      "tag": "recuperar_contraseña",
      "patterns": [
        "Olvidé mi contraseña",
        "¿Cómo recupero mi contraseña?",
        "No recuerdo mi clave",
        "Recuperar contraseña",
        "¿Qué hago si olvidé mi contraseña?",
        "Necesito recuperar mi clave",
        "Perdí mi contraseña"
      ],
      "responses": [
        "Para recuperar tu contraseña, ve a la opción 'Olvidé mi contraseña' en la plataforma correspondiente.",
        "Recupera tu contraseña utilizando la opción de recuperación en la plataforma donde la olvidaste.",
        "Si olvidaste tu contraseña, sigue el proceso de recuperación en la plataforma correspondiente."
      ]
    },
    {
      "tag": "autenticacion_dos_factores",
      "patterns": [
        "¿Qué es la autenticación de dos factores?",
        "Autenticación de dos factores",
        "2FA",
        "¿Cómo funciona la autenticación de dos factores?",
        "Seguridad de dos factores",
        "¿Qué es 2FA?",
        "Autenticación en dos pasos"
      ],
      "responses": [
        "La autenticación de dos factores (2FA) añade una capa adicional de seguridad a tus cuentas. Requiere algo que sabes (tu contraseña) y algo que tienes (un código enviado a tu teléfono).",
        "2FA es un método de seguridad que requiere dos formas de verificación para acceder a una cuenta. Esto hace que sea más difícil para los atacantes acceder a tus cuentas.",
        "La autenticación de dos factores mejora la seguridad al requerir un segundo paso de verificación, como un código enviado a tu teléfono."
      ]
    },
    {
      "tag": "gestor_contraseñas",
      "patterns": [
        "¿Qué es un gestor de contraseñas?",
        "Gestor de contraseñas",
        "¿Cómo funciona un gestor de contraseñas?",
        "Recomendaciones de gestores de contraseñas",
        "¿Debo usar un gestor de contraseñas?",
        "Gestor de claves",
        "¿Qué gestor de contraseñas me recomiendas?"
      ],
      "responses": [
        "Un gestor de contraseñas es una herramienta que almacena y gestiona tus contraseñas de forma segura. Te permite usar contraseñas únicas y complejas sin tener que recordarlas todas.",
        "Los gestores de contraseñas son herramientas que te ayudan a almacenar y generar contraseñas seguras. Algunos populares son LastPass, Dashlane y 1Password.",
        "Un gestor de contraseñas es esencial para mantener tus cuentas seguras. Te recomiendo usar uno como LastPass o 1Password."
      ]
    },
    {
      "tag": "phishing",
      "patterns": [
        "¿Qué es el phishing?",
        "Phishing",
        "¿Cómo evitar el phishing?",
        "¿Qué hago si caí en phishing?",
        "Consejos para evitar phishing",
        "¿Cómo detectar phishing?",
        "Ataques de phishing"
      ],
      "responses": [
        "El phishing es un tipo de ataque en el que los atacantes intentan engañarte para que reveles información personal, como contraseñas o números de tarjetas de crédito.",
        "Para evitar el phishing, nunca hagas clic en enlaces sospechosos o descargues archivos de correos electrónicos no verificados.",
        "Si crees que has sido víctima de phishing, cambia tus contraseñas inmediatamente y contacta a tu banco si es necesario."
      ]
    },
    {
      "tag": "seguridad_wifi",
      "patterns": [
        "¿Cómo asegurar mi red WiFi?",
        "Seguridad de WiFi",
        "Proteger mi red inalámbrica",
        "¿Cómo hago mi WiFi más seguro?",
        "Consejos para WiFi seguro",
        "Seguridad en redes inalámbricas",
        "¿Qué hacer para proteger mi WiFi?"
      ],
      "responses": [
        "Para asegurar tu red WiFi, cambia la contraseña predeterminada del router, usa encriptación WPA3 y oculta el nombre de tu red (SSID).",
        "Protege tu WiFi usando una contraseña fuerte, actualizando el firmware del router y desactivando WPS.",
        "Asegura tu red WiFi cambiando la contraseña, usando encriptación fuerte y limitando el acceso a dispositivos conocidos."
      ]
    },
    {
      "tag": "actualizar_software",
      "patterns": [
        "¿Por qué es importante actualizar el software?",
        "Actualizar software",
        "¿Cómo actualizo mi software?",
        "Importancia de las actualizaciones",
        "Actualizaciones de seguridad",
        "¿Qué pasa si no actualizo mi software?",
        "Consejos para actualizar software"
      ],
      "responses": [
        "Actualizar el software es crucial porque las actualizaciones a menudo incluyen parches de seguridad que protegen contra vulnerabilidades conocidas.",
        "Mantén tu software actualizado para protegerte contra ataques. Las actualizaciones corrigen fallos de seguridad y mejoran el rendimiento.",
        "No actualizar tu software puede dejarte expuesto a ataques. Asegúrate de instalar las actualizaciones tan pronto como estén disponibles."
      ]
    },
    {
      "tag": "backup",
      "patterns": [
        "¿Cómo hago un backup de mis datos?",
        "Backup de datos",
        "¿Qué es un backup?",
        "Consejos para hacer backup",
        "¿Cómo proteger mis datos?",
        "Copia de seguridad",
        "¿Qué hacer para respaldar mis datos?"
      ],
      "responses": [
        "Un backup es una copia de seguridad de tus datos. Haz backups regularmente en un disco duro externo o en la nube para protegerte contra pérdidas.",
        "Para hacer un backup, usa herramientas como Google Drive, Dropbox o un disco duro externo. Asegúrate de hacerlo regularmente.",
        "Haz copias de seguridad de tus datos importantes en la nube o en un dispositivo externo. Esto te protegerá en caso de pérdida o ataque."
      ]
    },
    {
      "tag": "seguridad_navegacion",
      "patterns": [
        "¿Cómo navegar de forma segura?",
        "Seguridad en internet",
        "Consejos para navegar seguro",
        "¿Cómo proteger mi navegación?",
        "Navegación segura",
        "¿Qué hacer para navegar seguro?",
        "Protección en línea"
      ],
      "responses": [
        "Para navegar de forma segura, usa HTTPS, evita sitios sospechosos y no descargues archivos de fuentes no confiables.",
        "Protege tu navegación usando un navegador actualizado, extensiones de seguridad y evitando sitios web no seguros.",
        "Navega de forma segura usando una VPN, evitando redes WiFi públicas y manteniendo tu navegador actualizado."
      ]
    },
    {
      "tag": "seguridad_correo",
      "patterns": [
        "¿Cómo proteger mi correo electrónico?",
        "Seguridad de correo",
        "Consejos para correo seguro",
        "¿Cómo evitar el spam?",
        "Protección de correo electrónico",
        "¿Qué hacer para proteger mi email?",
        "Seguridad en el correo"
      ],
      "responses": [
        "Protege tu correo electrónico usando contraseñas fuertes, autenticación de dos factores y evitando abrir correos sospechosos.",
        "Para proteger tu correo, no hagas clic en enlaces o archivos adjuntos de remitentes desconocidos y usa filtros de spam.",
        "Mantén tu correo seguro usando contraseñas únicas, 2FA y revisando regularmente la configuración de seguridad."
      ]
    },
    {
      "tag": "seguridad_redes_sociales",
      "patterns": [
        "¿Cómo proteger mis redes sociales?",
        "Seguridad en redes sociales",
        "Consejos para redes sociales seguras",
        "¿Cómo evitar el robo de cuentas?",
        "Protección de redes sociales",
        "¿Qué hacer para proteger mis cuentas?",
        "Seguridad en Facebook, Instagram, etc."
      ],
      "responses": [
        "Protege tus redes sociales usando contraseñas fuertes, autenticación de dos factores y revisando los permisos de las aplicaciones conectadas.",
        "Para mantener seguras tus redes sociales, no compartas información personal y revisa regularmente la configuración de privacidad.",
        "Usa contraseñas únicas y 2FA en tus redes sociales. Además, evita aceptar solicitudes de amistad de desconocidos."
      ]
    },
    {
      "tag": "seguridad_dispositivos",
      "patterns": [
        "¿Cómo proteger mi teléfono?",
        "Seguridad en dispositivos móviles",
        "Consejos para proteger mi computadora",
        "¿Cómo asegurar mi laptop?",
        "Protección de dispositivos",
        "¿Qué hacer para proteger mi teléfono?",
        "Seguridad en smartphones"
      ],
      "responses": [
        "Protege tu teléfono usando un PIN o contraseña fuerte, manteniendo el software actualizado y evitando descargar aplicaciones de fuentes no confiables.",
        "Para proteger tu computadora, usa un antivirus, mantén el sistema operativo actualizado y haz backups regulares.",
        "Asegura tus dispositivos usando contraseñas fuertes, encriptación y evitando conectarte a redes WiFi públicas no seguras."
      ]
    },
    {
      "tag": "seguridad_nube",
      "patterns": [
        "¿Cómo proteger mis datos en la nube?",
        "Seguridad en la nube",
        "Consejos para nube segura",
        "¿Cómo asegurar mi almacenamiento en la nube?",
        "Protección de datos en la nube",
        "¿Qué hacer para proteger mis archivos en la nube?",
        "Seguridad en Google Drive, Dropbox, etc."
      ],
      "responses": [
        "Protege tus datos en la nube usando contraseñas fuertes, autenticación de dos factores y encriptación de archivos.",
        "Para mantener seguros tus archivos en la nube, usa servicios confiables y revisa regularmente los permisos de acceso.",
        "Asegura tu almacenamiento en la nube usando 2FA, contraseñas únicas y evitando compartir enlaces públicos de tus archivos."
      ]
    },
    {
      "tag": "seguridad_pagos_online",
      "patterns": [
        "¿Cómo proteger mis pagos en línea?",
        "Seguridad en pagos online",
        "Consejos para pagos seguros",
        "¿Cómo evitar fraudes en pagos?",
        "Protección de pagos en línea",
        "¿Qué hacer para proteger mis transacciones?",
        "Seguridad en compras online"
      ],
      "responses": [
        "Protege tus pagos en línea usando tarjetas virtuales, verificando que el sitio web sea seguro (HTTPS) y evitando compartir información en redes públicas.",
        "Para pagos seguros, usa servicios como PayPal, revisa los detalles de la transacción y no compartas tus datos de tarjeta en sitios no confiables.",
        "Mantén seguros tus pagos en línea usando autenticación de dos factores y revisando regularmente los estados de cuenta de tu banco."
      ]
    },
    {
      "tag": "seguridad_niños",
      "patterns": [
        "¿Cómo proteger a mis hijos en internet?",
        "Seguridad para niños",
        "Consejos para niños en línea",
        "¿Cómo asegurar el acceso de mis hijos?",
        "Protección de niños en internet",
        "¿Qué hacer para proteger a mis hijos en línea?",
        "Seguridad en internet para niños"
      ],
      "responses": [
        "Protege a tus hijos en internet usando controles parentales, limitando el tiempo de pantalla y enseñándoles sobre los peligros en línea.",
        "Para mantener seguros a tus hijos, supervisa su actividad en línea y usa herramientas de control parental en dispositivos y aplicaciones.",
        "Enseña a tus hijos sobre seguridad en internet y usa herramientas como controles parentales para limitar el acceso a contenido inapropiado."
      ]
    },
    {
      "tag": "seguridad_empresas",
      "patterns": [
        "¿Cómo proteger mi empresa en línea?",
        "Seguridad para empresas",
        "Consejos para seguridad empresarial",
        "¿Cómo asegurar los datos de mi empresa?",
        "Protección de datos empresariales",
        "¿Qué hacer para proteger mi negocio en línea?",
        "Seguridad en empresas"
      ],
      "responses": [
        "Protege tu empresa en línea usando firewalls, encriptación de datos y capacitando a tus empleados en seguridad cibernética.",
        "Para mantener segura tu empresa, implementa políticas de seguridad, haz backups regulares y usa herramientas de detección de intrusiones.",
        "Asegura los datos de tu empresa usando contraseñas fuertes, autenticación de dos factores y revisando regularmente los permisos de acceso."
      ]
    },
    {
      "tag": "seguridad_vpn",
      "patterns": [
        "¿Qué es una VPN?",
        "VPN",
        "¿Cómo funciona una VPN?",
        "Consejos para usar VPN",
        "¿Por qué usar una VPN?",
        "Protección con VPN",
        "Seguridad en redes públicas con VPN"
      ],
      "responses": [
        "Una VPN (Red Privada Virtual) encripta tu conexión a internet, protegiendo tu privacidad y seguridad en redes públicas.",
        "Usa una VPN para proteger tu privacidad en línea, especialmente en redes WiFi públicas. Te ayuda a ocultar tu dirección IP y encriptar tu tráfico.",
        "Una VPN es esencial para navegar de forma segura en redes públicas. Te recomiendo usar servicios como NordVPN o ExpressVPN."
      ]
    },
    {
      "tag": "seguridad_antivirus",
      "patterns": [
        "¿Necesito un antivirus?",
        "Antivirus",
        "¿Cómo elegir un antivirus?",
        "Consejos para antivirus",
        "¿Qué antivirus me recomiendas?",
        "Protección con antivirus",
        "Seguridad con software antivirus"
      ],
      "responses": [
        "Un antivirus es esencial para proteger tu dispositivo contra malware y virus. Te recomiendo usar programas como Norton, McAfee o Bitdefender.",
        "Elige un antivirus que ofrezca protección en tiempo real, actualizaciones regulares y escaneo de archivos descargados.",
        "Usa un antivirus confiable para proteger tu dispositivo. Asegúrate de mantenerlo actualizado y ejecutar escaneos regulares."
      ]
    },
    {
      "tag": "seguridad_criptomonedas",
      "patterns": [
        "¿Cómo proteger mis criptomonedas?",
        "Seguridad en criptomonedas",
        "Consejos para criptomonedas seguras",
        "¿Cómo asegurar mi billetera de criptomonedas?",
        "Protección de criptomonedas",
        "¿Qué hacer para proteger mis criptoactivos?",
        "Seguridad en Bitcoin, Ethereum, etc."
      ],
      "responses": [
        "Protege tus criptomonedas usando billeteras hardware, contraseñas fuertes y autenticación de dos factores.",
        "Para mantener seguras tus criptomonedas, usa billeteras frías (offline) y nunca compartas tus claves privadas.",
        "Asegura tus criptomonedas usando billeteras confiables, contraseñas únicas y evitando compartir información sensible en línea."
      ]
    },
    {
      "tag": "seguridad_iot",
      "patterns": [
        "¿Cómo proteger mis dispositivos IoT?",
        "Seguridad en IoT",
        "Consejos para dispositivos IoT seguros",
        "¿Cómo asegurar mis dispositivos inteligentes?",
        "Protección de IoT",
        "¿Qué hacer para proteger mis dispositivos conectados?",
        "Seguridad en dispositivos inteligentes"
      ],
      "responses": [
        "Protege tus dispositivos IoT cambiando las contraseñas predeterminadas, actualizando el firmware y usando redes WiFi seguras.",
        "Para mantener seguros tus dispositivos IoT, desactiva funciones innecesarias y usa encriptación en tu red.",
        "Asegura tus dispositivos IoT usando contraseñas fuertes, actualizaciones regulares y evitando conectarlos a redes públicas."
      ]
    },
    {
      "tag": "seguridad_redes",
      "patterns": [
        "¿Cómo proteger mi red doméstica?",
        "Seguridad en redes domésticas",
        "Consejos para redes seguras",
        "¿Cómo asegurar mi red local?",
        "Protección de redes",
        "¿Qué hacer para proteger mi red?",
        "Seguridad en redes caseras"
      ],
      "responses": [
        "Protege tu red doméstica cambiando la contraseña del router, usando encriptación WPA3 y ocultando el SSID.",
        "Para mantener segura tu red, desactiva WPS, limita el acceso a dispositivos conocidos y usa un firewall.",
        "Asegura tu red doméstica usando contraseñas fuertes, actualizando el firmware del router y monitoreando los dispositivos conectados."
      ]
    },
    {
      "tag": "seguridad_cloud",
      "patterns": [
        "¿Cómo proteger mis datos en la nube?",
        "Seguridad en la nube",
        "Consejos para nube segura",
        "¿Cómo asegurar mi almacenamiento en la nube?",
        "Protección de datos en la nube",
        "¿Qué hacer para proteger mis archivos en la nube?",
        "Seguridad en Google Drive, Dropbox, etc."
      ],
      "responses": [
        "Protege tus datos en la nube usando contraseñas fuertes, autenticación de dos factores y encriptación de archivos.",
        "Para mantener seguros tus archivos en la nube, usa servicios confiables y revisa regularmente los permisos de acceso.",
        "Asegura tu almacenamiento en la nube usando 2FA, contraseñas únicas y evitando compartir enlaces públicos de tus archivos."
      ]
    },
    {
      "tag": "seguridad_pagos_online",
      "patterns": [
        "¿Cómo proteger mis pagos en línea?",
        "Seguridad en pagos online",
        "Consejos para pagos seguros",
        "¿Cómo evitar fraudes en pagos?",
        "Protección de pagos en línea",
        "¿Qué hacer para proteger mis transacciones?",
        "Seguridad en compras online"
      ],
      "responses": [
        "Protege tus pagos en línea usando tarjetas virtuales, verificando que el sitio web sea seguro (HTTPS) y evitando compartir información en redes públicas.",
        "Para pagos seguros, usa servicios como PayPal, revisa los detalles de la transacción y no compartas tus datos de tarjeta en sitios no confiables.",
        "Mantén seguros tus pagos en línea usando autenticación de dos factores y revisando regularmente los estados de cuenta de tu banco."
      ]
    },
    {
      "tag": "seguridad_niños",
      "patterns": [
        "¿Cómo proteger a mis hijos en internet?",
        "Seguridad para niños",
        "Consejos para niños en línea",
        "¿Cómo asegurar el acceso de mis hijos?",
        "Protección de niños en internet",
        "¿Qué hacer para proteger a mis hijos en línea?",
        "Seguridad en internet para niños"
      ],
      "responses": [
        "Protege a tus hijos en internet usando controles parentales, limitando el tiempo de pantalla y enseñándoles sobre los peligros en línea.",
        "Para mantener seguros a tus hijos, supervisa su actividad en línea y usa herramientas de control parental en dispositivos y aplicaciones.",
        "Enseña a tus hijos sobre seguridad en internet y usa herramientas como controles parentales para limitar el acceso a contenido inapropiado."
      ]
    },
    {
      "tag": "seguridad_empresas",
      "patterns": [
        "¿Cómo proteger mi empresa en línea?",
        "Seguridad para empresas",
        "Consejos para seguridad empresarial",
        "¿Cómo asegurar los datos de mi empresa?",
        "Protección de datos empresariales",
        "¿Qué hacer para proteger mi negocio en línea?",
        "Seguridad en empresas"
      ],
      "responses": [
        "Protege tu empresa en línea usando firewalls, encriptación de datos y capacitando a tus empleados en seguridad cibernética.",
        "Para mantener segura tu empresa, implementa políticas de seguridad, haz backups regulares y usa herramientas de detección de intrusiones.",
        "Asegura los datos de tu empresa usando contraseñas fuertes, autenticación de dos factores y revisando regularmente los permisos de acceso."
      ]
    },
    {
      "tag": "seguridad_vpn",
      "patterns": [
        "¿Qué es una VPN?",
        "VPN",
        "¿Cómo funciona una VPN?",
        "Consejos para usar VPN",
        "¿Por qué usar una VPN?",
        "Protección con VPN",
        "Seguridad en redes públicas con VPN"
      ],
      "responses": [
        "Una VPN (Red Privada Virtual) encripta tu conexión a internet, protegiendo tu privacidad y seguridad en redes públicas.",
        "Usa una VPN para proteger tu privacidad en línea, especialmente en redes WiFi públicas. Te ayuda a ocultar tu dirección IP y encriptar tu tráfico.",
        "Una VPN es esencial para navegar de forma segura en redes públicas. Te recomiendo usar servicios como NordVPN o ExpressVPN."
      ]
    },
    {
      "tag": "seguridad_antivirus",
      "patterns": [
        "¿Necesito un antivirus?",
        "Antivirus",
        "¿Cómo elegir un antivirus?",
        "Consejos para antivirus",
        "¿Qué antivirus me recomiendas?",
        "Protección con antivirus",
        "Seguridad con software antivirus"
      ],
      "responses": [
        "Un antivirus es esencial para proteger tu dispositivo contra malware y virus. Te recomiendo usar programas como Norton, McAfee o Bitdefender.",
        "Elige un antivirus que ofrezca protección en tiempo real, actualizaciones regulares y escaneo de archivos descargados.",
        "Usa un antivirus confiable para proteger tu dispositivo. Asegúrate de mantenerlo actualizado y ejecutar escaneos regulares."
      ]
    },
    {
      "tag": "seguridad_criptomonedas",
      "patterns": [
        "¿Cómo proteger mis criptomonedas?",
        "Seguridad en criptomonedas",
        "Consejos para criptomonedas seguras",
        "¿Cómo asegurar mi billetera de criptomonedas?",
        "Protección de criptomonedas",
        "¿Qué hacer para proteger mis criptoactivos?",
        "Seguridad en Bitcoin, Ethereum, etc."
      ],
      "responses": [
        "Protege tus criptomonedas usando billeteras hardware, contraseñas fuertes y autenticación de dos factores.",
        "Para mantener seguras tus criptomonedas, usa billeteras frías (offline) y nunca compartas tus claves privadas.",
        "Asegura tus criptomonedas usando billeteras confiables, contraseñas únicas y evitando compartir información sensible en línea."
      ]
    },
    {
      "tag": "seguridad_iot",
      "patterns": [
        "¿Cómo proteger mis dispositivos IoT?",
        "Seguridad en IoT",
        "Consejos para dispositivos IoT seguros",
        "¿Cómo asegurar mis dispositivos inteligentes?",
        "Protección de IoT",
        "¿Qué hacer para proteger mis dispositivos conectados?",
        "Seguridad en dispositivos inteligentes"
      ],
      "responses": [
        "Protege tus dispositivos IoT cambiando las contraseñas predeterminadas, actualizando el firmware y usando redes WiFi seguras.",
        "Para mantener seguros tus dispositivos IoT, desactiva funciones innecesarias y usa encriptación en tu red.",
        "Asegura tus dispositivos IoT usando contraseñas fuertes, actualizaciones regulares y evitando conectarlos a redes públicas."
      ]
    },
    {
      "tag": "seguridad_redes",
      "patterns": [
        "¿Cómo proteger mi red doméstica?",
        "Seguridad en redes domésticas",
        "Consejos para redes seguras",
        "¿Cómo asegurar mi red local?",
        "Protección de redes",
        "¿Qué hacer para proteger mi red?",
        "Seguridad en redes caseras"
      ],
      "responses": [
        "Protege tu red doméstica cambiando la contraseña del router, usando encriptación WPA3 y ocultando el SSID.",
        "Para mantener segura tu red, desactiva WPS, limita el acceso a dispositivos conocidos y usa un firewall.",
        "Asegura tu red doméstica usando contraseñas fuertes, actualizando el firmware del router y monitoreando los dispositivos conectados."
      ]
    },
    {
      "tag": "contraseña_maestra",
      "patterns": [
        "¿Qué es una contraseña maestra?",
        "Contraseña maestra",
        "¿Cómo funciona una contraseña maestra?",
        "Definición de contraseña maestra"
      ],
      "responses": [
        "Una contraseña maestra es una contraseña única y segura que se utiliza para acceder a un gestor de contraseñas. Protege todas las demás contraseñas almacenadas en el gestor.",
        "La contraseña maestra es la clave principal para acceder a tu gestor de contraseñas. Debe ser extremadamente segura y única.",
        "Es la contraseña que usas para desbloquear tu gestor de contraseñas. Asegúrate de que sea fuerte y no la compartas con nadie."
      ]
    },
    {
      "tag": "ataque_fuerza_bruta",
      "patterns": [
        "¿Qué es un ataque de fuerza bruta?",
        "Ataque de fuerza bruta",
        "¿Cómo funciona un ataque de fuerza bruta?",
        "Definición de ataque de fuerza bruta"
      ],
      "responses": [
        "Un ataque de fuerza bruta es cuando un atacante intenta adivinar una contraseña probando todas las combinaciones posibles hasta encontrar la correcta. Por eso es importante usar contraseñas largas y complejas.",
        "Es un método en el que un hacker prueba todas las combinaciones posibles de contraseñas hasta encontrar la correcta. Las contraseñas largas y complejas son más difíciles de adivinar.",
        "En un ataque de fuerza bruta, el atacante prueba miles de combinaciones de contraseñas. Por eso es crucial usar contraseñas únicas y difíciles de adivinar."
      ]
    },
    {
      "tag": "hash_contraseña",
      "patterns": [
        "¿Qué es un hash de contraseña?",
        "Hash de contraseña",
        "¿Cómo funciona el hash de contraseñas?",
        "Definición de hash de contraseña"
      ],
      "responses": [
        "Un hash de contraseña es una representación cifrada de una contraseña. Los sistemas almacenan hashes en lugar de contraseñas en texto plano para protegerlas en caso de una filtración de datos.",
        "El hash es una versión encriptada de tu contraseña. Los sistemas lo usan para proteger tus credenciales sin almacenar la contraseña real.",
        "Es un código único generado a partir de tu contraseña. Los hashes son seguros porque no se pueden revertir para obtener la contraseña original."
      ]
    },
    {
      "tag": "salt_criptografia",
      "patterns": [
        "¿Qué es la sal en criptografía?",
        "Sal en criptografía",
        "¿Cómo funciona la sal en contraseñas?",
        "Definición de sal en criptografía"
      ],
      "responses": [
        "La sal es un valor aleatorio que se añade a una contraseña antes de aplicar el hash. Esto hace que incluso contraseñas idénticas tengan hashes diferentes, lo que aumenta la seguridad.",
        "Es un valor aleatorio que se agrega a las contraseñas antes de encriptarlas. Esto evita que dos contraseñas iguales tengan el mismo hash.",
        "La sal es una técnica de seguridad que añade aleatoriedad a las contraseñas antes de hashearlas, lo que dificulta los ataques de fuerza bruta."
      ]
    },
    {
      "tag": "verificar_filtracion_contraseña",
      "patterns": [
        "¿Cómo sé si mi contraseña ha sido filtrada?",
        "Verificar si mi contraseña fue filtrada",
        "¿Dónde puedo revisar si mi contraseña fue expuesta?",
        "Consejos para verificar filtraciones de contraseñas"
      ],
      "responses": [
        "Puedes usar servicios como 'Have I Been Pwned' para verificar si tu contraseña ha sido expuesta en alguna filtración de datos conocida.",
        "Visita sitios como 'Have I Been Pwned' e ingresa tu correo o contraseña para verificar si han sido comprometidos en alguna brecha de seguridad.",
        "Usa herramientas en línea como 'Have I Been Pwned' para comprobar si tu contraseña ha sido parte de una filtración de datos."
      ]
    },
    {
      "tag": "autenticacion_multifactor",
      "patterns": [
        "¿Qué es la autenticación multifactor?",
        "Autenticación multifactor",
        "¿Cómo funciona la autenticación multifactor?",
        "Definición de autenticación multifactor"
      ],
      "responses": [
        "La autenticación multifactor es un método de seguridad que requiere más de una forma de verificación para acceder a una cuenta, como una contraseña y un código enviado a tu teléfono.",
        "Es una capa adicional de seguridad que requiere dos o más formas de verificación, como algo que sabes (contraseña) y algo que tienes (código de autenticación).",
        "La autenticación multifactor (MFA) añade una segunda capa de seguridad, como un código enviado a tu teléfono, para proteger tus cuentas."
      ]
    },
    {
      "tag": "keylogger",
      "patterns": [
        "¿Qué es un keylogger?",
        "Keylogger",
        "¿Cómo funciona un keylogger?",
        "Definición de keylogger"
      ],
      "responses": [
        "Un keylogger es un tipo de malware que registra las teclas que presionas, lo que puede permitir a un atacante capturar tus contraseñas. Para protegerte, usa software antivirus y evita descargar archivos sospechosos.",
        "Es un programa malicioso que registra todo lo que escribes en el teclado, incluyendo contraseñas. Mantén tu sistema protegido con un buen antivirus.",
        "Un keylogger captura todo lo que escribes, incluyendo contraseñas. Para evitarlo, no descargues archivos de fuentes no confiables y usa software de seguridad."
      ]
    },
    {
      "tag": "contrasena_unico_uso",
      "patterns": [
        "¿Qué es una contraseña de un solo uso?",
        "Contraseña de un solo uso",
        "¿Cómo funciona una contraseña de un solo uso?",
        "Definición de contraseña de un solo uso"
      ],
      "responses": [
        "Una contraseña de un solo uso (OTP) es una contraseña temporal que se utiliza para una sola sesión o transacción. Es común en la autenticación de dos factores.",
        "Es una contraseña que solo se puede usar una vez, generalmente enviada a tu teléfono o correo. Es muy segura porque expira después de su uso.",
        "Las contraseñas de un solo uso son temporales y se usan para autenticación adicional. Son ideales para transacciones sensibles."
      ]
    },
    {
      "tag": "encriptacion_contrasena",
      "patterns": [
        "¿Qué es la encriptación de contraseñas?",
        "Encriptación de contraseñas",
        "¿Cómo funciona la encriptación de contraseñas?",
        "Definición de encriptación de contraseñas"
      ],
      "responses": [
        "La encriptación de contraseñas es el proceso de convertir una contraseña en un formato ilegible para protegerla de accesos no autorizados. Solo se puede descifrar con una clave específica.",
        "Es una técnica que convierte tu contraseña en un código ilegible. Solo se puede revertir con la clave correcta, lo que la hace muy segura.",
        "La encriptación protege tus contraseñas convirtiéndolas en datos ilegibles. Sin la clave correcta, nadie puede acceder a ellas."
      ]
    },
    {
      "tag": "ataque_diccionario",
      "patterns": [
        "¿Qué es un ataque de diccionario?",
        "Ataque de diccionario",
        "¿Cómo funciona un ataque de diccionario?",
        "Definición de ataque de diccionario"
      ],
      "responses": [
        "Un ataque de diccionario es un método en el que un atacante intenta adivinar una contraseña probando palabras comunes o frases de un diccionario. Por eso es importante evitar usar palabras comunes en tus contraseñas.",
        "Es un tipo de ataque donde el hacker prueba palabras comunes del diccionario para adivinar tu contraseña. Usa contraseñas complejas para evitarlo.",
        "En un ataque de diccionario, el atacante prueba palabras comunes. Por eso es crucial usar contraseñas que no sean palabras reales."
      ]
    },
    {
      "tag": "gestor_contrasenas_offline",
      "patterns": [
        "¿Qué es un gestor de contraseñas offline?",
        "Gestor de contraseñas offline",
        "¿Cómo funciona un gestor de contraseñas offline?",
        "Definición de gestor de contraseñas offline"
      ],
      "responses": [
        "Un gestor de contraseñas offline almacena tus contraseñas en un dispositivo local en lugar de en la nube. Esto puede ser más seguro, pero requiere que hagas backups manuales.",
        "Es un gestor de contraseñas que guarda tus claves en tu dispositivo, sin conexión a internet. Es más seguro, pero debes hacer copias de seguridad.",
        "Un gestor offline guarda tus contraseñas en tu computadora o dispositivo. Es seguro, pero asegúrate de hacer backups para no perderlas."
      ]
    },
    {
      "tag": "contrasena_biometrica",
      "patterns": [
        "¿Qué es una contraseña biométrica?",
        "Contraseña biométrica",
        "¿Cómo funciona una contraseña biométrica?",
        "Definición de contraseña biométrica"
      ],
      "responses": [
        "Una contraseña biométrica utiliza características físicas únicas, como huellas dactilares o reconocimiento facial, para autenticar a un usuario. Es más segura que las contraseñas tradicionales.",
        "Es un método de autenticación que usa rasgos físicos, como tu huella digital o rostro, para verificar tu identidad. Es muy seguro y difícil de falsificar.",
        "Las contraseñas biométricas usan características únicas de tu cuerpo, como tu huella o tu cara, para proteger tus cuentas."
      ]
    },
    {
      "tag": "phishing_contrasena",
      "patterns": [
        "¿Qué es un ataque de phishing de contraseñas?",
        "Phishing de contraseñas",
        "¿Cómo funciona el phishing de contraseñas?",
        "Definición de phishing de contraseñas"
      ],
      "responses": [
        "Un ataque de phishing de contraseñas es cuando un atacante intenta engañarte para que reveles tu contraseña a través de un correo electrónico o sitio web falso. Siempre verifica la autenticidad de los sitios antes de ingresar tus credenciales.",
        "Es un tipo de fraude donde los atacantes te engañan para que des tu contraseña en un sitio falso. Nunca ingreses tus datos en enlaces sospechosos.",
        "El phishing de contraseñas es un intento de robar tus credenciales mediante sitios o correos falsos. Siempre verifica la URL antes de ingresar tus datos."
      ]
    },
    {
      "tag": "politica_contrasena",
      "patterns": [
        "¿Qué es una política de contraseñas?",
        "Política de contraseñas",
        "¿Cómo funciona una política de contraseñas?",
        "Definición de política de contraseñas"
      ],
      "responses": [
        "Una política de contraseñas es un conjunto de reglas que definen cómo deben ser las contraseñas en un sistema, como la longitud mínima, el uso de caracteres especiales y la frecuencia de cambio.",
        "Es un conjunto de normas que establecen cómo deben ser las contraseñas, como su complejidad y cuándo deben cambiarse. Ayuda a mantener la seguridad.",
        "Las políticas de contraseñas son reglas que aseguran que las contraseñas sean seguras, como requerir mayúsculas, números y símbolos."
      ]
    },
    {
      "tag": "contrasena_recuperacion",
      "patterns": [
        "¿Qué es una contraseña de recuperación?",
        "Contraseña de recuperación",
        "¿Cómo funciona una contraseña de recuperación?",
        "Definición de contraseña de recuperación"
      ],
      "responses": [
        "Una contraseña de recuperación es una contraseña alternativa que se utiliza para acceder a una cuenta si olvidas tu contraseña principal. Debe ser igual de segura que tu contraseña principal.",
        "Es una contraseña que usas para recuperar el acceso a tu cuenta si olvidas la principal. Asegúrate de que sea fuerte y segura.",
        "Las contraseñas de recuperación son claves alternativas que te permiten acceder a tu cuenta si pierdes la contraseña principal."
      ]
    },
    {
      "tag": "relleno_credenciales",
      "patterns": [
        "¿Qué es un ataque de relleno de credenciales?",
        "Ataque de relleno de credenciales",
        "¿Cómo funciona un ataque de relleno de credenciales?",
        "Definición de ataque de relleno de credenciales"
      ],
      "responses": [
        "Un ataque de relleno de credenciales es cuando un atacante usa contraseñas filtradas de una brecha de datos para intentar acceder a otras cuentas. Por eso es importante usar contraseñas únicas para cada cuenta.",
        "Es un tipo de ataque donde los hackers usan contraseñas filtradas para intentar acceder a otras cuentas. Usa contraseñas únicas para evitarlo.",
        "En un ataque de relleno de credenciales, los atacantes prueban contraseñas filtradas en otras cuentas. Por eso es crucial no reutilizar contraseñas."
      ]
    },
    {
      "tag": "contrasena_temporal",
      "patterns": [
        "¿Qué es una contraseña temporal?",
        "Contraseña temporal",
        "¿Cómo funciona una contraseña temporal?",
        "Definición de contraseña temporal"
      ],
      "responses": [
        "Una contraseña temporal es una contraseña que se genera para un uso limitado, como cuando se restablece una contraseña. Debe cambiarse inmediatamente después de su primer uso.",
        "Es una contraseña que solo se usa una vez, generalmente para restablecer el acceso a una cuenta. Cambia la contraseña después de usarla.",
        "Las contraseñas temporales son claves de un solo uso. Asegúrate de cambiarlas por una contraseña permanente después de usarlas."
      ]
    },
    {
      "tag": "token_seguridad",
      "patterns": [
        "¿Qué es un token de seguridad?",
        "Token de seguridad",
        "¿Cómo funciona un token de seguridad?",
        "Definición de token de seguridad"
      ],
      "responses": [
        "Un token de seguridad es un dispositivo físico o aplicación que genera códigos de un solo uso para la autenticación de dos factores. Aumenta la seguridad de tus cuentas.",
        "Es una herramienta que genera códigos temporales para verificar tu identidad. Es muy útil para la autenticación de dos factores.",
        "Los tokens de seguridad son dispositivos o apps que generan códigos únicos para proteger tus cuentas. Son ideales para la autenticación adicional."
      ]
    },
    {
      "tag": "contrasena_compartida",
      "patterns": [
        "¿Qué es una contraseña compartida?",
        "Contraseña compartida",
        "¿Cómo funciona una contraseña compartida?",
        "Definición de contraseña compartida"
      ],
      "responses": [
        "Una contraseña compartida es una contraseña que varias personas conocen y utilizan para acceder a un mismo recurso. Esto es menos seguro, ya que aumenta el riesgo de que la contraseña sea comprometida.",
        "Es una contraseña que varias personas usan para acceder a una cuenta o recurso. Es menos segura porque no puedes controlar quién la conoce.",
        "Las contraseñas compartidas son claves que varias personas usan. Evítalas siempre que sea posible, ya que aumentan el riesgo de seguridad."
      ]
    },
     {
          "tag": "seguridad_dispositivos_moviles",
          "patterns": [
            "¿Cómo proteger mi celular?",
            "Consejos para seguridad en móviles",
            "¿Cómo evitar virus en mi smartphone?",
            "Seguridad en teléfonos inteligentes",
            "Protección contra malware en móviles"
          ],
          "responses": [
            "Para proteger tu celular, mantén el sistema operativo actualizado, usa autenticación biométrica y evita descargar apps de fuentes desconocidas.",
            "Evita conectar tu smartphone a redes WiFi públicas sin protección y usa una VPN para mayor seguridad.",
            "Instala solo aplicaciones de tiendas oficiales y revisa los permisos antes de conceder acceso a tus datos."
          ]
        },
        {
          "tag": "seguridad_dispositivos_corporativos",
          "patterns": [
            "¿Cómo proteger los dispositivos de mi empresa?",
            "Seguridad para equipos corporativos",
            "Consejos para dispositivos en la empresa",
            "Protección contra amenazas en la empresa",
            "Evitar ataques en dispositivos de trabajo"
          ],
          "responses": [
            "Implementa políticas de seguridad estrictas y usa software de monitoreo en dispositivos empresariales.",
            "Asegura que los empleados utilicen autenticación de dos factores y accedan solo a recursos esenciales.",
            "Realiza auditorías de seguridad periódicas y protege la información con cifrado."
          ]
        },
        {
          "tag": "seguridad_identidad_digital",
          "patterns": [
            "¿Cómo proteger mi identidad en línea?",
            "Evitar robo de identidad",
            "Consejos para seguridad de identidad digital",
            "Seguridad en perfiles en línea",
            "Protección de identidad en internet"
          ],
          "responses": [
            "No compartas información personal en redes sociales y usa contraseñas únicas para cada cuenta.",
            "Configura alertas para detectar accesos sospechosos a tus cuentas y habilita la autenticación en dos pasos.",
            "Utiliza un gestor de contraseñas para evitar reutilizar credenciales y reducir el riesgo de robo de identidad."
          ]
        },
        {
          "tag": "proteccion_ransomware",
          "patterns": [
            "¿Cómo protegerme del ransomware?",
            "Evitar ataques de ransomware",
            "Consejos para evitar ransomware",
            "Protección contra secuestro de datos",
            "Ransomware y cómo evitarlo"
          ],
          "responses": [
            "Mantén copias de seguridad actualizadas en un almacenamiento externo o en la nube.",
            "No abras archivos adjuntos ni enlaces sospechosos en correos electrónicos desconocidos.",
            "Usa un software de seguridad con protección contra ransomware y manténlo actualizado."
          ]
        },
        {
              "tag": "seguridad_banca_online",
              "patterns": [
                "¿Cómo proteger mi cuenta bancaria en línea?",
                "Seguridad en la banca online",
                "¿Cómo evitar fraudes bancarios?",
                "Protección para cuentas bancarias",
                "Consejos para usar la banca en línea"
              ],
              "responses": [
                "Usa contraseñas seguras y autenticación de dos factores para proteger tu cuenta bancaria en línea.",
                "No ingreses a tu cuenta bancaria desde redes WiFi públicas y revisa regularmente tus transacciones.",
                "Activa notificaciones de seguridad para estar al tanto de cualquier actividad sospechosa en tu cuenta."
              ]
            },
            {
              "tag": "seguridad_dispositivos_inteligentes",
              "patterns": [
                "¿Cómo proteger mi smart TV?",
                "Seguridad en dispositivos inteligentes",
                "¿Cómo asegurar mi asistente de voz?",
                "Protección de dispositivos conectados",
                "Evitar hackeos en dispositivos inteligentes"
              ],
              "responses": [
                "Actualiza regularmente el firmware de tus dispositivos inteligentes y cambia las contraseñas predeterminadas.",
                "Desactiva funciones innecesarias en tus dispositivos y usa una red WiFi separada para mayor seguridad.",
                "Evita compartir datos sensibles con asistentes de voz y revisa las configuraciones de privacidad."
              ]
            },
            {
              "tag": "seguridad_en_redes_publicas",
              "patterns": [
                "¿Es seguro conectarse a WiFi público?",
                "Riesgos de usar redes públicas",
                "¿Cómo navegar seguro en redes públicas?",
                "Protección al usar WiFi gratis",
                "Evitar ataques en redes públicas"
              ],
              "responses": [
                "Evita ingresar datos sensibles cuando uses una red WiFi pública y utiliza una VPN para mayor seguridad.",
                "Desactiva la conexión automática a redes WiFi desconocidas y usa solo sitios con HTTPS.",
                "Si necesitas conectarte a una red pública, evita hacer transacciones bancarias o ingresar contraseñas."
              ]
            },
            {
              "tag": "seguridad_troyanos",
              "patterns": [
                "¿Qué es un troyano?",
                "Cómo funcionan los troyanos",
                "¿Cómo evitar troyanos?",
                "Protección contra malware troyano",
                "¿Cómo eliminar un troyano?"
              ],
              "responses": [
                "Un troyano es un tipo de malware que se disfraza de software legítimo para engañarte y obtener acceso a tu sistema.",
                "Evita descargar archivos de fuentes no confiables y mantén tu antivirus actualizado para prevenir troyanos.",
                "Si crees que tienes un troyano, ejecuta un escaneo de seguridad y elimina cualquier programa sospechoso."
              ]
            },
            {
              "tag": "seguridad_tarjetas_credito",
              "patterns": [
                "¿Cómo proteger mi tarjeta de crédito?",
                "Evitar fraudes con tarjetas",
                "Consejos de seguridad para tarjetas bancarias",
                "¿Es seguro pagar con tarjeta en línea?",
                "Protección contra clonación de tarjetas"
              ],
              "responses": [
                "Nunca compartas los datos de tu tarjeta y usa solo sitios web seguros para hacer compras.",
                "Activa notificaciones de transacciones y usa tarjetas virtuales para pagos en línea.",
                "Si notas actividad sospechosa en tu tarjeta, contacta inmediatamente a tu banco."
              ]
            }
          ]
        }
        
